{
  "listing_id": 29,
  "listing_name": "Western Cowboy USA America Howdy Retro Movie Doodle - COPY 1",
  "count": 0,
  "images": [],
  "draft": {
    "collection_id": 29,
    "title": "SMARTYPANTS Western Howdy Mug - Retro Cowboy Themed Coffee Cup For Her Women Men - Cute American Country Doodle Art Design - Novelty USA Drinkware For Home Office Kitchen - 11oz Ceramic Tea Present",
    "description": "Greet your morning with a cheerful \"Howdy!\" and a touch of Wild West charm. This delightful mug from SMARTYPANTS features a <b>unique retro doodle design</b>, celebrating all things cowboy and Americana. From boots and hats to desert landscapes, the wrap-around artwork is a conversation starter, making it the perfect companion for your morning coffee or afternoon tea.<br><br>Expertly crafted from <b>durable white ceramic</b>, this 11oz mug is built for daily enjoyment. The high-quality print ensures the fun, vintage-inspired graphics remain vibrant and won't fade over time. For your convenience, it's both <b>dishwasher and microwave safe</b>, fitting seamlessly into your busy lifestyle. Whether you're buying it as a special treat for yourself or as a <b>thoughtful gift for a friend</b>, this Western-themed cup is sure to bring a smile to anyone's face.",
    "keywords": "gifts presents birthday christmas secret santa stocking filler leaving work gift fathers mothers day valentines anniversary congratulations thank you housewarming mum dad sister brother colleague boss girlfriend boyfriend partner coworker teacher student adult teen girl boy wild west southern texas nashville rodeo horse riding line dancing vintage funny hilarious joke cool unique stylish trendy graphic illustration sketch black white beige farm farming rancher beverage vessel stein",
    "bullets": [
      "Western Doodle Design – Say \"Howdy\" in style with this charming retro cowboy mug a perfect gift for friends and family who love country music Americana or unique art.",
      "Premium Ceramic Build – Crafted from high-quality white ceramic with a smooth glossy finish this sturdy 11oz mug is the ideal size for your favourite hot beverage.",
      "Everyday Convenience – Designed for modern life this cup is completely microwave safe for reheating drinks and dishwasher safe for effortless easy cleaning.",
      "Lasting Vibrant Print – Features a high-definition wrap-around design printed with durable fade-resistant inks ensuring the Western graphics stay sharp and clear.",
      "Versatile Gift Idea – Arrives securely packaged and ready for gifting making it a wonderful addition to any home kitchen office desk or workplace breakroom."
    ],
    "parent_sku": "HOW-COW-MUG-PARENT",
    "platform": "smartypants",
    "handle_colors": [
      "white"
    ],
    "variations": [
      {
        "color": "White",
        "ean": "5063040250748",
        "lineNumber": 1,
        "size": "N/A",
        "sku": "HOW-COW-MUG-WHI",
        "title": "Western Cowboy USA America Howdy Retro Movie Doodle WHITE MUG"
      }
    ],
    "bulk_input": "5063040250748\tWestern Cowboy USA America Howdy Retro Movie Doodle WHITE MUG\t\tHOW-COW-MUG-WHI\n",
    "saved_at": "2025-10-13T18:50:04.673Z"
  }
}